Reports/ApiAndSoap/20190806_090322/requests/main/5.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "request" : {
        "method" : "SOAP",
        "url" : "http://www.dneonline.com/calculator.asmx?wsdl",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "wsdl",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <Add xmlns=\"http://tempuri.org/\">\n            <intA>10</intA>\n            <intB>10</intB>\n        </Add>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 326,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><AddResponse xmlns=\"http://tempuri.org/\"><AddResult>20</AddResult></AddResponse></soap:Body></soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 183,
        "bodySize" : 326,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "receive" : 0,
        "dns" : -1,
        "wait" : 0,
        "send" : 0,
        "connect" : -1,
        "blocked" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "5",
        "testObjectId" : "Object Repository/Soap/addRequest",
        "harId" : "097a2874-567f-4b41-aafe-efe54a511d72"
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}